---
type: SpatialElementCalculationLocation
namespace: Autodesk.Revit.DB
version: 2024
members: 2
tags: [revit-api, class]
---

# SpatialElementCalculationLocation

`Autodesk.Revit.DB.SpatialElementCalculationLocation` · Revit 2024 · 2 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Property | MarkerPosition | 2014 | `public XYZ MarkerPosition { get ; }` |
| Property | Parameter | — | `` |